In [1]:
import pandas as pd
import seaborn as sn
import json

In [2]:
with open('filtered.json') as json_file:
  data = json.load(json_file)

  annotations = data['annotations']
  categories = data['categories']

with open('captions.json') as json_file:
  data = json.load(json_file)

  captions = data['annotations']

In [3]:
df = pd.DataFrame.from_dict(annotations)
cat_df = pd.DataFrame.from_dict(categories)
cap_df = pd.DataFrame.from_dict(captions)

In [4]:
df.head()

,segmentation,area,iscrowd,image_id,bbox,category_id,id
0,"[[510.66, 423.01, 511.72, 420.03, 510.45, 416....",702.10575,0,289343,"[473.07, 395.93, 38.65, 28.67]",3,1768
1,"[[204.01, 306.23, 206.07, 295.92, 216.38, 281....",5463.68640,0,289343,"[204.01, 235.08, 60.84, 177.36]",1,201376
2,"[[289.74, 443.39, 302.29, 445.32, 308.09, 427....",27718.47630,0,61471,"[272.1, 200.23, 151.97, 279.77]",3,1773
3,"[[147.76, 396.11, 158.48, 355.91, 153.12, 347....",78969.31690,0,472375,"[124.71, 196.18, 372.85, 356.81]",3,2551
4,"[[260.4, 231.26, 215.06, 274.01, 194.33, 307.6...",108316.66515,0,520301,"[112.71, 154.82, 367.29, 479.35]",3,3186

In [5]:
cat_df.head()

  supercategory  id    name
0        person   1  person
1        animal   2     cat
2        animal   3     dog

In [6]:
cap_df.head()

   image_id   id                                            caption
0    179765   38  A black Honda motorcycle parked in front of a ...
1    179765  182      A Honda motorcycle parked in a grass driveway
2    190236  401  An office cubicle with four different types of...
3    331352  441          A small closed toilet in a cramped space.
4    517069  447     Two women waiting at a bench next to a street.